bench/results/java21/20260425T111714Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 300, "warmup_s": 120, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 6654.81, "p50": "3.46ms", "p95": "5.71ms", "p99": "6.57ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 5m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.60ms    0.97ms  16.89ms   71.70%\n    Req/Sec     1.67k   124.94     1.92k    73.50%\n  Latency Distribution\n     50%    3.46ms\n     75%    4.12ms\n     90%    4.86ms\n     99%    6.57ms\n  1997092 requests in 5.00m, 455.19MB read\nRequests/sec:   6654.81\nTransfer/sec:      1.52MB"}